TexasInstruments/ind-comms-sdk/examples/industrial_comms/ethernetip_adapter_demo/device_profiles/discrete_io_device/rgmii/am243x-lp/r5fss0-0_freertos/example.syscfg
section9.$name                       = "Log Shared Memory";
section9.load_memory                 = "LOG_SHM_MEM";
section9.type                        = "NOLOAD";
section9.group                       = false;
section9.output_section.create(1);
section9.output_section[0].$name     = ".bss.log_shared_mem";
section9.output_section[0].alignment = 0;

section10.$name                       = "IPC Shared Memory";
section10.type                        = "NOLOAD";
section10.load_memory                 = "RTOS_NORTOS_IPC_SHM_MEM";
section10.group                       = false;
section10.output_section.create(1);
section10.output_section[0].$name     = ".bss.ipc_vring_mem";
section10.output_section[0].alignment = 0;

section11.$name                       = "Non Cacheable Memory";
section11.load_memory                 = "NON_CACHE_MEM";
section11.group                       = false;
section11.type                        = "NOLOAD";
section11.output_section.create(1);
section11.output_section[0].$name     = ".bss.nocache";
section11.output_section[0].alignment = 0;

section12.$name                        = "TCMA Stack Segments";
section12.load_memory                  = "R5F_TCMA";
section12.output_section.create(1);
section12.output_section[0].$name      = ".stack";
section12.output_section[0].palignment = true;

section13.$name                        = "TCMB Stack Segments";
section13.load_memory                  = "R5F_TCMB0";
section13.output_section.create(1);
section13.output_section[0].palignment = true;
section13.output_section[0].$name      = ".threadstack";

section14.$name                        = "Packet Buffer Memory";
section14.type                         = "NOLOAD";
section14.group                        = false;
section14.load_memory                  = "ICSS_PKT_BUF_MEM";
section14.output_section.create(1);
section14.output_section[0].$name      = ".bss.icss_emac_pktbuf_mem";
section14.output_section[0].palignment = true;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
flash1.peripheralDriver.OSPI.CLK.$suggestSolution         = "ball.P20";
flash1.peripheralDriver.OSPI.CSn0.$suggestSolution        = "ball.L20";
flash1.peripheralDriver.OSPI.D3.$suggestSolution          = "ball.N19";
flash1.peripheralDriver.OSPI.D2.$suggestSolution          = "ball.L21";
flash1.peripheralDriver.OSPI.D1.$suggestSolution          = "ball.N20";
flash1.peripheralDriver.OSPI.D0.$suggestSolution          = "ball.L19";
i2c1.I2C.SCL.$suggestSolution                             = "ball.B16";
i2c1.I2C.SDA.$suggestSolution                             = "ball.B15";
uart1.MCU_UART.RXD.$suggestSolution                       = "ball.D6";
uart1.MCU_UART.TXD.$suggestSolution                       = "ball.B2";
ethernetip1.PRU_ICSSG1_MDIO.$suggestSolution              = "PRU_ICSSG1_MDIO0";
ethernetip1.PRU_ICSSG1_MDIO.MDC.$suggestSolution          = "ball.W1";
ethernetip1.PRU_ICSSG1_MDIO.MDIO.$suggestSolution         = "ball.V2";
ethernetip1.PRU_ICSSG1_IEP.$suggestSolution               = "PRU_ICSSG1_IEP0";
ethernetip1.PRU_ICSSG1_IEP.EDC_LATCH_IN0.$suggestSolution = "ball.Y4";
ethernetip1.PRU_ICSSG1_IEP.EDC_SYNC_OUT0.$suggestSolution = "ball.U3";
ethernetip1.PRU_ICSSG1_RGMII1.$suggestSolution            = "PRU_ICSSG1_RGMII2";
ethernetip1.PRU_ICSSG1_RGMII1.RD0.$suggestSolution        = "ball.AA10";
ethernetip1.PRU_ICSSG1_RGMII1.RD1.$suggestSolution        = "ball.Y10";
ethernetip1.PRU_ICSSG1_RGMII1.RD2.$suggestSolution        = "ball.Y11";
ethernetip1.PRU_ICSSG1_RGMII1.RD3.$suggestSolution        = "ball.V12";
ethernetip1.PRU_ICSSG1_RGMII1.RXC.$suggestSolution        = "ball.V10";
ethernetip1.PRU_ICSSG1_RGMII1.RX_CTL.$suggestSolution     = "ball.Y12";
ethernetip1.PRU_ICSSG1_RGMII1.TD0.$suggestSolution        = "ball.Y6";
ethernetip1.PRU_ICSSG1_RGMII1.TD1.$suggestSolution        = "ball.AA8";
ethernetip1.PRU_ICSSG1_RGMII1.TD2.$suggestSolution        = "ball.Y9";
ethernetip1.PRU_ICSSG1_RGMII1.TD3.$suggestSolution        = "ball.W9";
ethernetip1.PRU_ICSSG1_RGMII1.TXC.$suggestSolution        = "ball.Y8";
ethernetip1.PRU_ICSSG1_RGMII1.TX_CTL.$suggestSolution     = "ball.V9";
ethernetip1.PRU_ICSSG1_RGMII2.$suggestSolution            = "PRU_ICSSG1_RGMII1";
ethernetip1.PRU_ICSSG1_RGMII2.RD0.$suggestSolution        = "ball.V4";
ethernetip1.PRU_ICSSG1_RGMII2.RD1.$suggestSolution        = "ball.W5";
ethernetip1.PRU_ICSSG1_RGMII2.RD2.$suggestSolution        = "ball.AA4";
ethernetip1.PRU_ICSSG1_RGMII2.RD3.$suggestSolution        = "ball.Y5";
ethernetip1.PRU_ICSSG1_RGMII2.RXC.$suggestSolution        = "ball.Y2";
ethernetip1.PRU_ICSSG1_RGMII2.RX_CTL.$suggestSolution     = "ball.AA5";
ethernetip1.PRU_ICSSG1_RGMII2.TD0.$suggestSolution        = "ball.V5";
ethernetip1.PRU_ICSSG1_RGMII2.TD1.$suggestSolution        = "ball.W2";
ethernetip1.PRU_ICSSG1_RGMII2.TD2.$suggestSolution        = "ball.V6";
ethernetip1.PRU_ICSSG1_RGMII2.TD3.$suggestSolution        = "ball.AA7";
ethernetip1.PRU_ICSSG1_RGMII2.TXC.$suggestSolution        = "ball.W6";
ethernetip1.PRU_ICSSG1_RGMII2.TX_CTL.$suggestSolution     = "ball.Y7";
debug_log.uartLog.UART.RXD.$suggestSolution               = "ball.B10";
debug_log.uartLog.UART.TXD.$suggestSolution               = "ball.B11";
